Repository: 84000/data-translation-memory
Catalog: Toh_134-The_Absorption_That_Encapsulates_All_Merit-v2.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་མི་ལ་ལ་ཞིག་གིས་ནམ་མཁའ་ལ་རི་མོ་རྣམ་པ་སྣ་ཚོགས་བཀྲ་བ་སྟོན་པར་བྱེད་ན།
en: It is like this, son of noble family: imagine someone trying to paint an array of vivid images in the air.

source: རིགས་ཀྱི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: What do you think, son of noble family,

source: ཅི་མི་དེ་དཀའ་བ་བྱེད་པ་ཡིན་ནམ།
en: would it involve some difficulty for that person to do so?”

source: གསོལ་པ།
en: Vimalatejā replied,

source: བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་སོ། །
en: “Indeed it would, Blessed One.

source: བདེ་བར་གཤེགས་པ་དེ་དེ་ལྟ་ལགས་ཏེ།
en: Indeed it would, Bliss-Gone One.

source: མི་དེ་ནི་དཀའ་བ་བགྱིད་པ་ལགས་སོ། །
en: Such a person would indeed have difficulty in doing that.”

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་བདག་ཉིད་ཀྱང་ཉོན་མོངས་པ་མེད་ལ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཁམས་གསུམ་དུ་ཡང་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་བ་དང་།
en: “Son of noble family, certain bodhisattvas who are not truly afflicted in their nature will nevertheless undergo the process of affliction in the three realms in order to bring beings to maturity.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱས་ནས་ཀྱང་ཐེག་པ་གསུམ་སྟོན་པར་བྱེད་པ་དེ་དག་ནི་དེ་བས་ཀྱང་ཆེས་དཀའ་བ་བྱེད་པ་ཡིན་ནོ། །
en: While they bring those beings to maturity, they teach the three vehicles. This involves far more difficulty.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ཐར་པའི་སྒོ་ཡང་མཐོང་ལ།
en: “Blessed One, those bodhisattva great beings who have perceived the gate of liberation, yet

source: སེམས་ཅན་རྣམས་ལ་སྙིང་བརྩེ་བའི་སླད་དུ་ཁམས་གསུམ་ན་ཡང་གནས་པ་དེ་དག་ནི་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ལགས་སོ། །
en: out of their love for beings remain in the three realms, must indeed have great compassion.

source: བཅོམ་ལྡན་འདས་དཔེར་བགྱི་ན
en: It is analogous, Blessed One,

source: དགུམ་པའི་གནོད་པ་ལས་ཐར་པ་ལགས་པའི་མི་སླར་དགུམ་པའི་གནོད་པའི་གནས་སུ་མཆིས་ཏེ། དགུམ་པའི་གནོད་པ་བགྱིད་པ་རྣམས་ལ་འདི་སྐད་དུ་བདག་སོད་ཅིག །གཞན་མ་གསད་ཅིག་ཅེས་མཆི་བ་
en: to a person who first escapes his own threatened execution and then returns to the place where execution was threatened, telling the executioners, ‘Don’t kill anyone else! Kill me instead!’

source: དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་དགུམ་པའི་གནོད་པའི་གནོད་པ་ལྟ་བུ་ནི་ཁམས་གསུམ་ལགས་སོ། །
en: Blessed One, in this analogy the place where execution was threatened represents the three realms.

source: !དགོན་པར་བགྱི་བ་ལྟ་བུ་ནི་འཇིག་རྟེན་གནས་པ་ལགས་སོ། །
en: Being executed represents remaining in the world.

source: དགུམ་པའི་གནོད་པ་བགྱིད་པ་ལྟ་བུ་ནི་འདུ་བྱེད་རྣམས་ལགས་སོ། །
en: The threatening executioners represent the formations.

source: དགུམ་པའི་གནོད་པ་སྤངས་པ་ལྟ་བུ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁམས་གསུམ་ལས་རྣམ་པར་གྲོལ་བ་དེ་དག་ལགས་ཏེ།
en: Being rid of the threat of execution represents the bodhisattva great beings being free from the three realms, while in fact,

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བ་དང་། སེམས་ཅན་ཡོངས་སུ་དགྲོལ་བར་བགྱི་བའི་སླད་དུ་ཁམས་གསུམ་འབའ་ཞིག་ཏུ་རྒྱུ་ལགས་སོ། །
en: in order to bring all beings to maturity and in order to liberate all beings, they continue to do nothing but roam in those three realms.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ནི་སྙིང་རྗེ་ཆེན་པོའི་སེམས་བསྐྱེད་པ་དེས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཏོ། །
en: “Blessed One, by engendering a mindset of great compassion, bodhisattva great beings outshine all the śrāvakas and solitary buddhas.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: On what account?

source: བཅོམ་ལྡན་འདས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ལ་ནི་དེ་ལྟ་བུའི་སྙིང་རྗེ་ཆེན་པོ་ཡང་མ་མཆིས། ཐབས་ལ་མཁས་པ་ཡང་མ་མཆིས་པའི་སླད་དུའོ། །
en: Blessed One, on account of the fact that the śrāvakas and solitary buddhas do not have such great compassion, nor such expertise in methods.”

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ལ་བཀའ་སྩལ་པ།
en: The Blessed One now said to the mighty strongman Vimalatejā,

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཐོས་པའི་ཚོགས་ལ་ནི་ཇི་ལྟར་བརྩོན་པར་བྱ།
en: “Son of noble family, how should bodhisattva great beings exert themselves in the accumulation of learning?

source: དེས་ཐོས་པ་ནི་ཇི་ལྟར་བཙལ་བར་བྱ་ཞེ་ན།
en: And how should they strive in learning?

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མཁན་པོ་དང་། སློབ་དཔོན་ལ་ང་རྒྱལ་བཅོམ་པ་དང་། བཀའ་བློ་བདེ་བས་བླ་མའི་སྲི་ཞུ་དང་། གུས་པ་དང་། ཕངས་པ་དང་། གཅེས་པའི་སེམས་བསྐྱེད་པར་བྱའོ། །
en: Son of noble family, bodhisattva great beings should humble their pride before their preceptors and instructors, and compliantly engender a mindset of revering, respecting, admiring, and cherishing the teacher.

source: དེས་ཆོས་ལ་ནི་སྨན་གྱི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: In this way, they should regard the teachings as medicine.

source: མཁན་པོ་དང་སློབ་དཔོན་རྣམས་ལ་ནི་སྟོན་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: They should regard their preceptors and instructors as consultants.

source: དེས་བདག་ལ་ནི་ནད་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: They should regard themselves as sick people.

source: དེས་ཆོས་ཀྱི་གདམས་ངག་སྟོན་པ་ལ་ནི་སྨན་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: They should regard the one who bestows the Dharma instructions as a doctor.

source: དེས་སེམས་ཅན་ཐམས་ཅད་ལ་ནི་ནད་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: They should regard all beings as being ill.

source: དེས་སངས་རྒྱས་ཀྱི་ཆོས་ཚོལ་བ་ནི་ལུས་ལ་ཕངས་པར་མི་བྱའོ། །
en: “In pursuit of the Buddha’s teachings, they should have no concern for their physical well-being,

source: སྲོག་ལ་ལྷག་པར་ཆགས་པ་བསྐྱེད་པར་མི་བྱའོ། །
en: nor should they have any special attachment to their lives.

source: དངོས་པོ་སྣ་ཚོགས་ཡོངས་སུ་འཛིན་པ་རྣམས་ལ་ཡང་དེས་ཤིན་དུ་ཉོན་མོངས་པའི་འདུ་ཤེས་བསྐྱེད་པར་མི་བྱའོ། །
en: They should regard various possessions as utter encumbrances.

source: ནོར་ཕུན་སུམ་ཚོགས་པ་ལ་ཡང་དེས་ཆགས་པ་བསྐྱེད་པར་མི་བྱའོ། །
en: They should not develop attachment for being wealthy.

source: ཆོས་གཙོ་བོར་བྱས་ཏེ་ནོར་ཐམས་ཅད་ཡོངས་སུ་གཏང་བར་བྱའོ། །
en: They should focus on the Dharma and give up all valuables.

source: དམ་པའི་ཆོས་ཀྱི་དོན་དང་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་འཇིག་རྟེན་པ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བར་བྱའོ། །
en: They should forsake all worldly people in order to apprehend the sacred teachings and their meaning.

source: ཆོས་ཀྱི་རྙེད་པ་འདོད་པས་རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ཡོངས་སུ་གཏང་བར་བྱའོ། །
en: Seeking only spiritual achievement, they should forsake gain, respect, and eulogy.

source: ཆོས་ཀྱི་རྒྱལ་སྲིད་འདོད་པའི་ཕྱིར་རྒྱལ་སྲིད་ཐམས་ཅད་ཡོངས་སུ་གཏང་བར་བྱའོ། །
en: Seeking only spiritual dominion, they should forsake political authority.

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བར་འདོད་པས་དམ་པའི་ཆོས་ཡོངས་སུ་བཙལ་བ་ལ་བརྩོན་པར་བྱའོ། །
en: They should seek to give up all afflictions and exert themselves in pursuing the sacred Dharma.

source: དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པ་ཐོབ་པར་འགྱུར་རོ། །
en: Bodhisattva great beings who uphold the sacred Dharma gain possession of all roots of virtue.

source: རིགས་ཀྱི་བུ་དེ་བས་ན་བྱང་ཆུབ་འདོད་པ་དང་། བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་དང་། ཤེས་རབ་ཀྱི་ཀ་བ་བསྒྲེང་བར་འདོད་པ་རྣམས་ཀྱིས་ཐོས་པ་ལ་བརྩོན་པར་བྱའོ། །
en: Therefore, son of noble family, those who seek awakening, who wish to awaken fully to completely perfect buddhahood, and who wish to erect the pillars of insight, should exert themselves in learning.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ།
en: “Son of noble family, it is like this.

source: དཔེར་ན་ཁང་བཟངས་རྣམ་པར་རྒྱལ་བྱེད་ནི་ཀ་བས་བརྟན་པས་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་འདུ་བར་འགྱུར་བ་
en: Consider the way that due to the pillars that support the Palace of Victory, the gods of the Heaven of the Thirty-three have a gathering place.

source: དེ་བཞིན་དུ། རིགས་ཀྱི་བུ་ཤེས་རབ་ཀྱི་ཀ་བ་ནི་ཐོས་པའི་སྟོབས་ཀྱིས་ཡོངས་སུ་བཟུང་བས་གནས་ལ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་འདུ་བར་འགྱུར་རོ། །
en: In the same way, son of noble family, the pillars of insight are upheld through the strength of learning, making a gathering place for the whole world, including bodhisattva great beings and gods.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ནས་བྱང་ཆུབ་སེམས་དཔར་དམ་བཅས་ཏེ། བདག་སངས་རྒྱས་སུ་གྱུར་ཅིག་ཅེས་སྨྲས་ལ་
en: Son of noble family, bodhisattvas who form the resolve set on awakening vow to be a bodhisattva, saying, ‘May I become a buddha.’

source: དེ་ཡང་ཐོས་པ་ཡོངས་སུ་ཚོལ་བ་ལ་མི་བརྩོན་ན་སེམས་ཅན་ཐམས་ཅད་ཤེས་རབ་འཆལ་པར་བྱ་བ་ལ་ཞུགས་པ་ཡིན་ནོ། །
en: However, unless they exert themselves in pursuit of learning, they will be participating in the distortion of all beings’ insight.

source: རིགས་ཀྱི་བུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐོས་པ་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་འགྲུས་རྩོམ་པར་བྱེད་ན།
en: “Son of noble family, when a bodhisattva great being endeavors to exert himself in the pursuit of learning,

source: དེས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཤེས་རབ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཉེ་བར་བརྟན་པ་བྱས་པ་ཡིན་ནོ། །
en: it becomes a support for all beings to perfect their insight.

source: ལྷ་རྣམས་ཀྱང་དེའི་ཚེ་དེ་ལ་མགུ་ཞིང་ཡིད་བདེ་བར་གྱུར་ནས་
en: On these occasions, even the gods delight and rejoice in it, [proclaiming,]

source: ཨ་ལ་ལ་སྐྱེས་བུ་དམ་པ་འདིས་ནི་ཐོས་པ་དང་། བརྩོན་འགྲུས་དང་། ཤེས་རབ་སྦྱངས་པའི་བློས་སྟོབས་བཅུ་ཐོབ་པར་ནུས་སོ། །
en: ‘Ah! This sublime being—with his mind purified through learning, diligence, and insight—will be able to achieve the ten powers!

source: ཨ་ལ་ལ་སྐྱེས་བུ་དམ་པ་འདིས་ནི་ཤེས་རབ་ཀྱི་མཚོན་གྱིས་ཉོན་མོངས་པའི་དྲ་བའི་རྒྱུད་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་གཅད་པར་ནུས་སོ། །
en: Ah! This sublime being will be able to cut entirely through the whole incessant web of affliction with the sword of insight.

source: ཨ་ལ་ལ་སྐྱེས་བུ་དམ་པ་འདིས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་པར་ནུས་སོ། །
en: Ah! This sublime being will be able to teach the Dharma so that all beings may be rid of their afflictions.

source: ཨ་ལ་ལ་སྐྱེས་བུ་དམ་པ་འདིས་ནི་སྔོན་གྱི་རྒྱལ་བ་བཞུགས་བཞུགས་པའི་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པར་ནུས་སོ། །
en: Ah! This sublime being will be able to dwell at the seat of awakening, where the victorious ones of the past resided.

source: ཨ་ལ་ལ་སྐྱེས་བུ་དམ་པ་འདིས་ནི་བདུད་དཔུང་དང་བཞོན་པ་དང་བཅས་པ་ཕམ་པར་བྱེད་ནུས་སོ། །
en: Ah! This sublime being will be able to vanquish the hordes of demons, and even their mounts.

source: ཨ་ལ་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདིས་ནི་རྣམ་པ་བཅུ་གཉིས་དང་ལྡན་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་ནུས་སོ་ཞེས་ཆེད་དུ་རྗོད་པར་བྱེད་དོ། །
en: Ah! This bodhisattva will be able to turn the Dharma wheel with its twelve aspects!’

source: རིགས་ཀྱི་བུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཉན་པ་ལ་བརྩོན་པ་དེའི་ཚེ་རིགས་ཀྱི་བུ་བདུད་ཀྱི་གནས་ཐམས་ཅད་མོག་མོག་པོར་འགྱུར་རོ། །
en: “Son of noble family, when a bodhisattva exerts himself in learning the Dharma, then, son of noble family, the abodes of the demons fall into gloom.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བདུད་སྡིག་ཅན་རྣམས་དང་། བདུད་ཀྱི་རིས་ཀྱི་ལྷ་གང་དག་ཡིན་པ་དེ་དག་ཐམས་ཅད་དེའི་ཚེ་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་བར་འགྱུར་ཏེ
en: At the same time, all the evil demons and deities of the demonic legions throughout the great trichiliocosm experience pain and despondency, [thinking,]

source: འདི་ནི་བདག་ཅག་གི་དབང་དུ་མི་འགྱུར་རོ། །
en: ‘This being is not in our control.

source: འདི་ལ་ནི་བདག་ཅག་དབང་མེད་དོ། །
en: We have no power over him.

source: འདིས་ནི་བདག་ཅག་རྣམ་པ་ཐམས་ཅད་དུ་བཅོམ་མོ། །
en: He will totally destroy us.

source: འདིས་ནི་བདག་ཅག་དབང་དུ་བྱས་སོ་སྙམ་མོ། །
en: He has control over us.’

source: རིགས་ཀྱི་བུ་འདི་ལྟར་ཐོས་པ་དང་ལྡན་ན་ཤེས་རབ་སྐྱེ་བར་འགྱུར་རོ། །
en: Because with such learning, son of noble family, one develops insight.

source: ཤེས་རབ་དང་ལྡན་ན་ཉོན་མོངས་པ་ཞི་བར་འགྱུར་རོ། །
en: With insight, the afflictions are pacified.

source: ཉོན་མོངས་པ་མེད་ན་བདུད་ཀྱིས་གླགས་མི་རྙེད་དོ། །
en: Without afflictions, demons have no ingress.

source: ཐོས་པ་དང་ལྡན་ན་རྟོག་པར་འགྱུར་རོ། །
en: With learning comes understanding.

source: རྟོག་པ་ཡོད་ན་ཚུལ་བཞིན་དུ་ཆོས་ཡོངས་སུ་ཚོལ་བར་འགྱུར་རོ། །
en: With understanding, one pursues the Dharma in the correct way.

source: ཚུལ་བཞིན་དུ་ཆོས་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་ན་བདུད་སྡིག་ཅན་གྱིས་གླགས་མི་རྙེད་དོ། །
en: When one exerts oneself in genuine pursuit of the Dharma, evil demons will have no ingress.

source: ཐོས་པ་དང་ལྡན་ན་ལོག་པར་ལྟ་བ་དང་བྲལ་བར་འགྱུར་ལ་ཡང་དག་པའི་ལྟ་བ་ཡང་སྐྱེད་པར་འགྱུར་རོ། །
en: With learning, one is freed of wrong views and engenders the genuine view.

source: ཡང་དག་པར་ཞུགས་ན་བདུད་ཀྱིས་གླགས་མི་རྙེད་དོ། །
en: When one is immersed in what is genuine, demons have no ingress.

source: ཡང་དག་པར་ཞུགས་ན་དོན་ལ་ཉེ་བར་རྟོག་པ་དང་གནོད་པ་དང་འབྲལ་བར་འགྱུར་རོ། །
en: Immersed in what is genuine, one comes to understand the meaning and becomes invulnerable.

source: དོན་འདོད་ན་དོན་ལ་ཡང་དག་པར་འབྲང་བར་འགྱུར་ཏེ།
en: Seeking the true, one genuinely pursues that truth.

source: རིགས་ཀྱི་བུ་རྣམ་གྲངས་དེས་ཀྱང་ཐོས་པ་མང་པོ་ལ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བདུད་བཞི་ཕམ་པར་བྱེད་ནུས་པར་འགྱུར་བ་དེ་ལྟར་རིག་པར་བྱའོ། །
en: “Son of noble family, you should understand from these descriptions how bodhisattva great beings, who exert themselves in extensive learning, become able to vanquish the four demons.

source: ཕུང་པོའི་བདུད་དང་། ཉོན་མོངས་པའི་བདུད་དང་། འཆི་བདག་གི་བདུད་དང་། ལྷའི་བུའི་བདུད་དེ། བདུད་བཞི་པོ་འདི་དག་ཕམ་པར་བྱེད་ནུས་སོ། །
en: The demon of the aggregates, the demon of the afflictions, the demon of the lord of death, and the demon of the god—these are the four demons will they be able to vanquish.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཇི་ལྟར་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དོན་དུ་གཉེར་བ་དང་། ཆོས་འདོད་པ་རྣམས་ཀྱིས་ཐོས་པ་ཡོངས་སུ་བཙལ་བ་དེ་ལས་ཆུང་ཟད་ཙམ་ཁྱོད་ལ་བསྟན་པར་བྱའོ། །
en: “Moreover, son of noble family, let me relate to you just a little of the way bodhisattvas of the past, who strove for and pursued the Dharma, endeavored in learning.

source: རིགས་ཀྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པ་བས་ཀྱང་ཆེས་གྲངས་མེད་པ། ཡུན་རིང་པོ་ཚད་མེད་བསམ་གྱིས་མི་ཁྱབ་པ། འདས་པ་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཆེན་པོ་མཆོག་ཅེས་བྱ་བ།
en: Son of noble family, once, an immeasurably and inconceivably long time ago—immeasurably further back than an incalculable eon—there lived a great sage by the name Supreme One.

source: ནགས་དང་། ནགས་འདབ་དང་། རི་ལ་གནས་པ། མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ། རྟག་ཏུ་བྱམས་པ་ལ་གནས་པ་དང་། སྙིང་རྗེ་ལ་གནས་པ་ཞིག་བྱུང་སྟེདྲང་སྲོང་དེ་མཆོག་ཏུ་གྱུར་ཏོ། །
en: He was an eminent sage who dwelt in the forests, woods, and mountains, possessed the five superknowledges, and lived his life totally out of love and compassion.

source: དེ་ནགས་ཁུང་དེ་དག་ན་གནས་པ་ན་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “One day, as he was staying in the woods, he began to ponder,

source: བདག་བྱམས་པ་ལ་གནས་པ་འདི་ནི་སེམས་ཅན་རྣམས་ཀྱི་དགའ་བ་སྐྱེད་པར་ཡང་མི་འགྱུར་ལ།
en: ‘The fact that I live my life by love does not seem to make anyone happy.

source: བྱམས་པ་འདིས་ནི་སེམས་ཅན་རྣམས་ཀྱི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་རྣམས་དང་བསྐལ་པ་མཐའ་ཡས་པ་ནས་བསགས་པའི་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱང་ཉེ་བར་ཞི་བར་བྱེད་མི་ནུས་སོ། །
en: It seems love cannot pacify the attachment, anger, or delusion of beings, nor any of the afflictions they have accrued over the course of infinite eons.

source: བྱམས་པ་འདིས་ནི་འཕགས་པའི་ཡང་དག་པའི་ལྟ་བ་ཡང་བསྐྱེད་པར་མི་ནུས་སོ་སྙམ་མོ། །
en: Love does not seem to lead to the genuine view of the noble ones.’

source: འཕགས་པའི་ཡང་དག་པའི་ལྟ་བ་གང་ལས་སྐྱེ་ཞིག་གུ་སྙམ་མོ། །
en: ‘So where does the genuine view of the noble ones come from?’

source: དེ་ལ་རྟོག་པ་འདི་ལྟ་བུ་ཞིག་བྱུང་སྟེ།
en: And then the idea came to him:

source: འཕགས་པའི་ཡང་དག་པའི་ལྟ་བ་སྐྱེ་བ་ལ་ནི་རྒྱུ་གཉིས་དང་། རྐྱེན་གཉིས་ཡོད་དེ།
en: ‘There seem to be two causes, two conditions that lead to the genuine view of the noble ones.

source: གཞན་གྱི་སྒྲ་དང་། སོ་སོར་རང་གི་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་སྟེ།
en: Others’ words, and one’s own correct mental engagement.

source: འདི་གཉིས་ནི་འཕགས་པའི་ཡང་དག་པའི་ལྟ་བ་སྐྱེ་བའི་རྒྱུ་གཉིས་དང་རྐྱེན་གཉིས་པོ་ཡིན་སྙམ་མོ། །
en: These must be the two causes, the two conditions that lead to the genuine view of the noble ones.’

source: དེ་དེའི་ཚེ་ཆོས་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་པའི་བློ་སྐྱེས་ཏེ། ལེགས་པར་གསུངས་པ་བདག་གིས་ག་ལས་རྙེད་པར་འགྱུར་སྙམ་མོ། །
en: He then resolved to exert himself in quest of the Dharma, with the thought, ‘Now, where will I find the sublime teachings?’

source: དེ་ཆོས་ཀྱི་ཕྱིར་ཆོས་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་ནས་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་དུ་སོང་ནས་ཆོས་བཙལ་ཏོ། །
en: “His ardent spiritual quest for the Dharma led him throughout many villages, cities, towns, countries, kingdoms, and palaces.

source: བཙལ་ཀྱང་ཆོས་སྨྲ་བ་འགའ་ཡང་མ་རྙེད་དོ། །
en: Despite his efforts, he could not find anyone preaching the Dharma.

source: དེ་ནས་དེའི་མདུན་དུ་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་ཞིག་བྱུང་སྟེ།
en: Then there appeared before him a god from the demonic legions.

source: དེ་དྲང་སྲོང་དེའི་ཐད་དུ་སོང་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Advancing directly in front of the sage, the god announced,

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལས་སངས་རྒྱས་ཀྱིས་གསུངས་པའི་སངས་རྒྱས་ཀྱི་མཚན་གྱི་ཚིགས་སུ་བཅད་པ་གཅིག་བཟུང་བ་ང་ལ་ཡོད་དོ། །
en: ‘I have in my possession a verse about the names of the Buddha, which was spoken by one buddha among the blessed buddhas.’

source: དྲང་སྲོང་དེས་སྨྲས་པ། སྨྲོས་ཤིག །
en: “ ‘Then speak it,’ the sage answered.

source: ལྷ་དེས་སྨྲས་པ།
en: “The god replied,

source: གལ་ཏེ་ཁྱོད་ཀྱིས་རང་གི་ལུས་ལས་པགས་པ་བཤུས་ཏེ་ཉི་མ་ལ་སྐམས་ནས་ཤོག་བུར་བྱས་ཏེ།
en: ‘For that you will have to peel off your own skin and dry it in the sun to make paper out of it.

source: རང་གི་ཁྲག་དང་སྦྱར་བས་སྣག་ཚ་བྱས་ལ་རང་གི་རུས་པས་སྨྱུག་གུ་བྱས་ཏེ།
en: Then create an ink formed from your blood, and a pen from one of your bones.

source: ང་ལས་ཚིགས་སུ་བཅད་པ་དེ་འདྲི་ན་དེ་ལྟ་ན་སངས་རྒྱས་ཀྱིས་གསུངས་པའི་ཚིགས་སུ་བཅད་པ་དེ་ངས་ཁྱོད་ལ་སྦྱིན་ནོ། །
en: If you can do that, you may request from me this verse spoken by the Buddha, and I will bestow it on you.’

source: རིགས་ཀྱི་བུ་དེ་ནས་དྲང་སྲོང་ཆེན་པོ་མཆོག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Son of noble family, then the great sage Supreme One thought to himself, ‘

source: བདག་གི་ལུས་འདི་འཁོར་བ་ཐོག་མ་མེད་པ་ནས་སྐྱེ་བ་དེ་དང་དེ་དག་དང་སྐྱེ་བའི་གནས་དེ་དང་དེ་དག་ཏུ་བསྐལ་པ་འབུམ་ཕྲག་མང་པོར་ཉེས་པ་བྱས་ནས།
en: Since time immemorial in cyclic existence, for hundreds of thousands of eons, this body of mine has committed faults one rebirth after the next, taking all kinds of birth.

source: དགྲ་དང་གཤེད་མའི་ལག་ཏུ་སོང་ནས་ཆོམ་རྐུན་དང་རྒྱལ་པོས་བཀྲབས་པ་ལ་སོགས་པས་མཚོན་རྣོན་པོས་ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་དུམ་བུ་དུ་མར་བཅད་ཅིང་གཏུབས་ཏེ་ འདོད་པའི་ཕྱིར་དང་། ནོར་གྱི་ཕྱིར་དང་། བཅད་པ་དང་། བཅིང་བ་དང་། བརྡེག་པ་དང་། བསྡིགས་པ་ལ་སོགས་པ་དཀའ་བ་འབུམ་ཉམས་སུ་མྱོང་མོད་ཀྱི།
en: And how many hundreds of thousands of hardships have I had to endure—at the hands of enemies and murderers, or by thieves and royal henchmen, having all my body parts sliced and chopped into many pieces with sharp knives, and having been slashed, bound, beaten, and menaced, all for the sake of desire or greed.

source: འོན་ཀྱང་བདག་གི་ལུས་དེ་དག་དང་། ཚོར་བ་དེ་དག་གིས་སེམས་ཅན་སུ་ལ་ཡང་དོན་ཅི་ཡང་བྱས་པ་མེད་ན
en: And through all this, all of these bodies and all of these experiences I have undergone have done nothing to benefit even a single being.

source: ད་བདག་གིས་སྙིང་པོ་མེད་པའི་ལུས་འདིས་ཆོས་རྙེད་པར་འགྱུར་བ་ནི་བདག་གིས་རྙེད་པ་ལེགས་པར་རྙེད་དོ་སྙམ་ནས།
en: Now that with this worthless body I may acquire the Dharma—what a wonderful opportunity I have!’

source: དགའ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ། ལྷ་དེ་ལ་ཡང་སློབ་དཔོན་གྱི་འདུ་ཤེས་བསྐྱེད་ནས་
en: “Delighted and full of joy, he engendered the perception of that god as his instructor, and

source: མཚོན་རྣོན་པོས་རང་གི་ལུས་ལས་པགས་པ་བཤུས་ཏེ་ཉི་མ་ལ་སྐམས་ནས་ཤོག་བུར་བྱས་ཏེ།
en: with a sharp knife skinned his own body and dried it in the sun to make paper.

source: རང་གི་ལུས་ལས་ཁྲག་གཟགས་ནས་རང་གི་ཁྲག་གིས་སྣག་ཚ་སྦྱར་ཏེ།
en: He drew blood from his own body and used it to concoct ink.

source: རང་གི་རུས་པས་སྨྱུག་གུ་བྱས་ནས་ལྷ་དེ་ལ་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Finally he fashioned a pen from one of his bones, and then with his palms together addressed the god:

source: ལྷ་སངས་རྒྱས་ཀྱིས་གསུངས་པའི་སངས་རྒྱས་ཀྱི་མཚན་བསྡུས་པའི་ཚིགས་སུ་བཅད་པ་དེ་བདག་ལ་གསུངས་ཤིག །
en: ‘Divine being, please tell me the verse spoken by the Buddha that summarizes the names of the Buddha. I have done whatever you commanded.

source: ཁྱོད་ཀྱིས་ཇི་སྐད་བསྒོ་བ་བཞིན་དུ་བདག་གིས་བགྱིས་ལགས་ཏེ།
en: I have skinned my own body and dried it to make paper.

source: བདག་གིས་པགས་པ་བཤུས་ནས་སྐམས་ཏེ་ཤོག་བུར་བགྱིས་ནས་རང་གི་ཁྲག་གིས་སྣག་ཚ་སྦྱར་ཏེ།
en: I have concocted ink from my own blood.

source: རང་གི་རུས་པས་སྨྱུག་གུ་བགྱིས་ལགས་སོ་ཞེས་བྱས་སོ། །
en: I have fashioned a pen from my own bones.’

source: རིགས་ཀྱི་བུ་དེ་ནས་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་དེས་དྲང་སྲོང་ཆེན་པོ་མཆོག་དེའི་གུས་པ་དང་། དོན་དུ་གཉེར་བ་དེ་ལྟ་བུ་མཐོང་ནས། གནོང་གནོང་ལྟར་བྱས་ཏེ། དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ། །
en: “At that moment, son of noble family, faced with the great sage Supreme One’s devotion and eagerness, that god of the demonic legions became ashamed and vanished on the spot.

source: རིགས་ཀྱི་བུ་དེ་ནས་དྲང་སྲོང་ཆེན་པོ་མཆོག་དེས་དེའི་ཚེ་ལྷ་དེ་མི་སྣང་བར་གྱུར་པར་རིག་ནས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Son of noble family, witnessing the god vanish at that moment, the great sage Supreme One thought to himself,

source: བདག་གིས་ཚིགས་སུ་བཅད་པ་དེ་མ་ཐོས་སུ་ཟིན་ཀྱང་། གང་གི་ཕྱིར་བདག་གིས་ཆོས་ལ་གུས་པ་ཆེན་པོས་རང་གི་པགས་པ་བཤུས་ཏེ་སྐམས་ནས་
en: ‘Although I have not been able to hear that verse, it was to be able to hear it that, out of devotion to the Dharma, I peeled the skin from my own body, dried it to make paper,

source: རང་གི་ཁྲག་དང་སྦྱར་བ་དང་།
en: concocted ink from my own blood, and

source: རང་གི་རུས་པ་ཕྱུང་སྟེ་སྨྱུག་གུ་བྱས་པས་
en: pulled out one of my own bones to make a pen.

source: བདག་གི་ཆོས་ལ་གུས་པའི་དགེ་བའི་རྩ་བ་འདི་ཆུད་ཟ་བར་མི་འགྱུར་རོ། །
en: The root of virtue garnered through such an act of devotion to the Dharma will not be wasted;

source: སླུ་བར་ཡང་མི་འགྱུར་རོ། །
en: it will not fail.

source: འོན་ཀྱང་བདག་གིས་ལྷག་པའི་བསམ་པ་དང་། གཡོ་བ་མེད་པས་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེའི་སེམས་བསྐྱེད་ནས།
en: I did not succeed, but out of altruism and without hypocrisy, I engendered compassion for beings and

source: ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་པགས་པ་ཤོག་བུར་བྱས་ཏེ་རང་གི་ཁྲག་གིས་སྦྱར་ནས། རུས་པས་སྨྱུག་གུ་བྱས་པའི་ཆོས་ལ་གུས་པའི་བདེན་པ་དང་བདེན་པའི་ཚིག་གང་ཡིན་པའི་བདེན་པ་དང་བདེན་པའི་ཚིག་དེས་ན་འཇིག་རྟེན་གྱི་ཁམས་འདི་དང་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ན་ཆོས་གསུང་ཞིང་ཆོས་སྟོན་པ་བདག་ཉིད་ཆེན་པོ་སུ་བཞུགས་ཀྱང་རུང་སྟེ
en: made paper of my own skin, ink from my blood, and a pen from my bone without concern for life and limb. Thus, through whatever truth and honest words may be in my devotion to the Dharma, through such truth and honest words, may all the great beings who teach and expound on the Dharma, whether in this world or another,

source: དེ་དག་གིས་བདག་ལ་ཞལ་བསྟན་པར་གསོལ། བདག་ལ་ཆོས་ཀྱང་ཐོས་པར་མཛད་དུ་གསོལ་ཞེས་བྱས་སོ། །
en: please reveal themselves to me, and allow me to hear the Dharma!’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་དྲང་སྲོང་ཆེན་པོ་མཆོག་གིས་ཚིག་དེ་སྐད་ཅེས་སྨྲས་མ་ཐག་ཏུ་སྐད་ཅིག་དེ་དང་། ཐང་ཅིག་དེ་དང་། ཡུད་ཙམ་དེ་ཉིད་ལ་འོག་གི་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་སུམ་ཅུ་རྩ་གཉིས་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ནས་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ
en: “Son of noble family, as soon as the great sage Supreme One had said this, at that very moment, at that very instant, at that very second, his words were known in a world system thirty-two buddhafields below this one known as Totally Immaculate.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དྲི་མ་མེད་པར་གྲགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: There dwelt the Thus-Gone One, the foe-destroyer, the completely perfect Buddha Immaculately Renowned King. He lived there, flourished there, and taught the Dharma.

source: དེས་དྲང་སྲོང་ཆེན་པོ་མཆོག་དེའི་ལྷག་པའི་བསམ་པ་ཐུགས་སུ་ཆུད་དེ། འཛམ་བུའི་གླིང་འདིའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་ཡང་གཟིགས་ནས་
en: Knowing the great sage Supreme One’s pure intentions and perceiving, too, the maturity of the beings in this world,

source: དཔེར་ན་སྐྱེས་བུ་སྟོབས་དང་ལྡན་པའི་ལག་པ་བསྐུམ་པ་ལས་རྐྱོང་པའམ། བརྐྱང་པ་ལས་སྐུམ་པ་བཞིན་དུ་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་
en: “At that very moment, in that very instant, in that very second, as quickly as a strong person can stretch out his arm and draw it in,
